almanac.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-28 Fri 11:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Adam Massmann</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Adam Massmann" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<p>
<a href="index.html">{Back to Home}</a>
</p>

<div id="outline-container-org40d4153" class="outline-2">
<h2 id="org40d4153">New York City Central Park Weather Almanac</h2>
<div class="outline-text-2" id="text-org40d4153">
<p>
This site documents daily weather observations in New York City's
Central Park back to 1869<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. Data are from
<a href="https://www.ncei.noaa.gov/products/land-based-station/global-historical-climatology-network-daily">NOAA's Global Historical Climatology Network</a>. You can browse the
data using the links below. Or, if it is easier you can navigate
directly to a given day's website; each day's website has the
format <code>massma.github.io/almanac/YYYY-MM-DD.html</code>, where YYYY is
the four digit year, MM is the two digit month, and DD is the two
digit day. So for example to go to May 1st, 2004, you would just
navigate to <a href="http://massma.github.io/almanac/2004-05-01.html">http://massma.github.io/almanac/2004-05-01.html</a>.
</p>

<p>
<body><ul><li><a href="almanac/1869.html">1869</a></li><li><a href="almanac/1870.html">1870</a></li><li><a href="almanac/1871.html">1871</a></li><li><a href="almanac/1872.html">1872</a></li><li><a href="almanac/1873.html">1873</a></li><li><a href="almanac/1874.html">1874</a></li><li><a href="almanac/1875.html">1875</a></li><li><a href="almanac/1876.html">1876</a></li><li><a href="almanac/1877.html">1877</a></li><li><a href="almanac/1878.html">1878</a></li><li><a href="almanac/1879.html">1879</a></li><li><a href="almanac/1880.html">1880</a></li><li><a href="almanac/1881.html">1881</a></li><li><a href="almanac/1882.html">1882</a></li><li><a href="almanac/1883.html">1883</a></li><li><a href="almanac/1884.html">1884</a></li><li><a href="almanac/1885.html">1885</a></li><li><a href="almanac/1886.html">1886</a></li><li><a href="almanac/1887.html">1887</a></li><li><a href="almanac/1888.html">1888</a></li><li><a href="almanac/1889.html">1889</a></li><li><a href="almanac/1890.html">1890</a></li><li><a href="almanac/1891.html">1891</a></li><li><a href="almanac/1892.html">1892</a></li><li><a href="almanac/1893.html">1893</a></li><li><a href="almanac/1894.html">1894</a></li><li><a href="almanac/1895.html">1895</a></li><li><a href="almanac/1896.html">1896</a></li><li><a href="almanac/1897.html">1897</a></li><li><a href="almanac/1898.html">1898</a></li><li><a href="almanac/1899.html">1899</a></li><li><a href="almanac/1900.html">1900</a></li><li><a href="almanac/1901.html">1901</a></li><li><a href="almanac/1902.html">1902</a></li><li><a href="almanac/1903.html">1903</a></li><li><a href="almanac/1904.html">1904</a></li><li><a href="almanac/1905.html">1905</a></li><li><a href="almanac/1906.html">1906</a></li><li><a href="almanac/1907.html">1907</a></li><li><a href="almanac/1908.html">1908</a></li><li><a href="almanac/1909.html">1909</a></li><li><a href="almanac/1910.html">1910</a></li><li><a href="almanac/1911.html">1911</a></li><li><a href="almanac/1912.html">1912</a></li><li><a href="almanac/1913.html">1913</a></li><li><a href="almanac/1914.html">1914</a></li><li><a href="almanac/1915.html">1915</a></li><li><a href="almanac/1916.html">1916</a></li><li><a href="almanac/1917.html">1917</a></li><li><a href="almanac/1918.html">1918</a></li><li><a href="almanac/1919.html">1919</a></li><li><a href="almanac/1920.html">1920</a></li><li><a href="almanac/1921.html">1921</a></li><li><a href="almanac/1922.html">1922</a></li><li><a href="almanac/1923.html">1923</a></li><li><a href="almanac/1924.html">1924</a></li><li><a href="almanac/1925.html">1925</a></li><li><a href="almanac/1926.html">1926</a></li><li><a href="almanac/1927.html">1927</a></li><li><a href="almanac/1928.html">1928</a></li><li><a href="almanac/1929.html">1929</a></li><li><a href="almanac/1930.html">1930</a></li><li><a href="almanac/1931.html">1931</a></li><li><a href="almanac/1932.html">1932</a></li><li><a href="almanac/1933.html">1933</a></li><li><a href="almanac/1934.html">1934</a></li><li><a href="almanac/1935.html">1935</a></li><li><a href="almanac/1936.html">1936</a></li><li><a href="almanac/1937.html">1937</a></li><li><a href="almanac/1938.html">1938</a></li><li><a href="almanac/1939.html">1939</a></li><li><a href="almanac/1940.html">1940</a></li><li><a href="almanac/1941.html">1941</a></li><li><a href="almanac/1942.html">1942</a></li><li><a href="almanac/1943.html">1943</a></li><li><a href="almanac/1944.html">1944</a></li><li><a href="almanac/1945.html">1945</a></li><li><a href="almanac/1946.html">1946</a></li><li><a href="almanac/1947.html">1947</a></li><li><a href="almanac/1948.html">1948</a></li><li><a href="almanac/1949.html">1949</a></li><li><a href="almanac/1950.html">1950</a></li><li><a href="almanac/1951.html">1951</a></li><li><a href="almanac/1952.html">1952</a></li><li><a href="almanac/1953.html">1953</a></li><li><a href="almanac/1954.html">1954</a></li><li><a href="almanac/1955.html">1955</a></li><li><a href="almanac/1956.html">1956</a></li><li><a href="almanac/1957.html">1957</a></li><li><a href="almanac/1958.html">1958</a></li><li><a href="almanac/1959.html">1959</a></li><li><a href="almanac/1960.html">1960</a></li><li><a href="almanac/1961.html">1961</a></li><li><a href="almanac/1962.html">1962</a></li><li><a href="almanac/1963.html">1963</a></li><li><a href="almanac/1964.html">1964</a></li><li><a href="almanac/1965.html">1965</a></li><li><a href="almanac/1966.html">1966</a></li><li><a href="almanac/1967.html">1967</a></li><li><a href="almanac/1968.html">1968</a></li><li><a href="almanac/1969.html">1969</a></li><li><a href="almanac/1970.html">1970</a></li><li><a href="almanac/1971.html">1971</a></li><li><a href="almanac/1972.html">1972</a></li><li><a href="almanac/1973.html">1973</a></li><li><a href="almanac/1974.html">1974</a></li><li><a href="almanac/1975.html">1975</a></li><li><a href="almanac/1976.html">1976</a></li><li><a href="almanac/1977.html">1977</a></li><li><a href="almanac/1978.html">1978</a></li><li><a href="almanac/1979.html">1979</a></li><li><a href="almanac/1980.html">1980</a></li><li><a href="almanac/1981.html">1981</a></li><li><a href="almanac/1982.html">1982</a></li><li><a href="almanac/1983.html">1983</a></li><li><a href="almanac/1984.html">1984</a></li><li><a href="almanac/1985.html">1985</a></li><li><a href="almanac/1986.html">1986</a></li><li><a href="almanac/1987.html">1987</a></li><li><a href="almanac/1988.html">1988</a></li><li><a href="almanac/1989.html">1989</a></li><li><a href="almanac/1990.html">1990</a></li><li><a href="almanac/1991.html">1991</a></li><li><a href="almanac/1992.html">1992</a></li><li><a href="almanac/1993.html">1993</a></li><li><a href="almanac/1994.html">1994</a></li><li><a href="almanac/1995.html">1995</a></li><li><a href="almanac/1996.html">1996</a></li><li><a href="almanac/1997.html">1997</a></li><li><a href="almanac/1998.html">1998</a></li><li><a href="almanac/1999.html">1999</a></li><li><a href="almanac/2000.html">2000</a></li><li><a href="almanac/2001.html">2001</a></li><li><a href="almanac/2002.html">2002</a></li><li><a href="almanac/2003.html">2003</a></li><li><a href="almanac/2004.html">2004</a></li><li><a href="almanac/2005.html">2005</a></li><li><a href="almanac/2006.html">2006</a></li><li><a href="almanac/2007.html">2007</a></li><li><a href="almanac/2008.html">2008</a></li><li><a href="almanac/2009.html">2009</a></li><li><a href="almanac/2010.html">2010</a></li><li><a href="almanac/2011.html">2011</a></li><li><a href="almanac/2012.html">2012</a></li><li><a href="almanac/2013.html">2013</a></li><li><a href="almanac/2014.html">2014</a></li><li><a href="almanac/2015.html">2015</a></li><li><a href="almanac/2016.html">2016</a></li><li><a href="almanac/2017.html">2017</a></li><li><a href="almanac/2018.html">2018</a></li><li><a href="almanac/2019.html">2019</a></li><li><a href="almanac/2020.html">2020</a></li><li><a href="almanac/2021.html">2021</a></li><li><a href="almanac/2022.html">2022</a></li><li><a href="almanac/2023.html">2023</a></li></ul></body>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">Technically observations were at
nearby 5th Avenue and East 63rd street until 1920, where the site
moved to its current location by Belvedere Castle</p></div></div>


</div>
</div></div>
</body>
</html>
